/*翻转指定范围内的二进制位
任务描述
本关任务：程序填空，写一个表达式，将int整数x从第p位开始的向右n位（p从右至左编号为0~31）翻转（即1变为0，0变为1），其余各位保持不变。例如：
输入x的值：1234（对应二进制为00000000 00000000 00000100 11010010）；
输入p的值： 15 ，输入n的值： 8 ，
表达式完成计算后，x的值改变成：64466 （对应二进制为00000000 00000000 11111011 11010010）。

相关知识
为了完成本关任务，你需要掌握：

C语言位操作运算；
赋值运算符的功能。
编程要求
根据提示，在右侧编辑器Begin-End中填写表达式，表达式完成计算后，使得x的值改变成任务要求的结果。，其中 0 <= n <= p + 1， 0 <= p <= 31。

测试说明
平台会对你编写的代码进行测试：

测试输入：0 10 5     （输入的是x、p和n的值）
预期输出：1984       （输出的是计算表达式的值后x的值）

测试输入：12345 11 6
预期输出：16377

开始你的任务吧，Showtime！*/

#include <stdio.h>
int main()
{
    int x, p, n, y;
    scanf("%d%d%d", &x, &p, &n);
    y = (
#include "expression.h"
    );
    printf("%d", x);
    return 0;
}