/*将整数向右循环移动n位
任务描述
本关任务：程序填空，写一个表达式，将int整数x向右循环移动n位，即向右移出的位直接放在最高位。例如：
输入x的值：1234（对应二进制为00000000 00000000 00000100 11010010）；
输入n的值： 10 ，
表达式完成计算后，x的值改变成：880803841 （对应二进制为00110100 10 000000 00000000 00000001）。

相关知识
为了完成本关任务，你需要掌握：

基本数据类型的字长；
算术运算符与位运算符操作；
赋值运算的功能。
编程要求
根据提示，在右侧编辑器Begin-End中写出表达式，该表达式计算后，使得x的值改变成向右循环移动n位后的结果。

测试说明
平台会对你编写的代码进行测试：

测试输入：1 8       （输入的是x和n的值）
预期输出：16777216   （输出的是表达式计算后x的值）

测试输入：-128 2
预期输出：1073741792

测试输入：5678 64
预期输出：5678

开始你的任务吧，Showtime！*/

#include <stdio.h>
int main()
{
    int x, n, y;
    scanf("%d%d", &x, &n);
    y = (
#include "expression.h"
    );
    printf("%d", x);
    return 0;
}
